idList = [2205,2199,2192,2206,2193,2188,2182,2181,2176,2162,2161,2156,2151,2150,2145,2131,2109,2126,2103,2110,2087,2086,2080,2074,2075,2070,2064,2063,2058,2046,2045,2041,2130,2029,2028,2016,2025,2015,2009,1996,1995,1992,1961,1960,1956,1943,1944,1930,1931,1938,1926,1910,1911,1898,1907,1899,1894,1877,1876,1844,1845,1840,1864,1830,1831,1807,1827,1803,1778,1808,1779,1767,1768,1762,1751,1775,1752,1728,1724,1747,1715,1729,1716,1710,1688,1692,1693,1681,1682,1654,1657,1658,1645,1646,1634,1642,1630,1635,1615,1614,1611,1598,1599,1594,1582,1677,1581,1578,1564,1563,1558,1546,1547,1511,1542,1512,1506,1488,1489,1470,1464,1482,1459,1458,1454,1444,1445,1430,1424,1423,1411,1419,1410,1405,1385,1384,1471,1368,1369,1380,1363,1357,1358,1353,1338,1339,1333,1327,1313,1328,1299,1323,1314,1294,1293,1283,1278,1289,1284,1272,1273,1256,1261,1262,1268,1250,1251,1226,1231,1237,1232,1219,1220,1208,1203,1215,1209,1197,1198,1187,1188,1176,1177,1172,1165,1164,1159,1154,1153,1149,1144,1143,1138,1131,1193,1182,1132,1127,1120,1121,1115,1109,1110,1105,1099,1100,1085,1078,1077,1073,1065,1060,1066,1052,1046,1040,1041,1035,1030,1029,1025,1017,1018,1012,1007,1006,1002,997,996,1053,991,985,984,973,980,974,965,957,956,954,952,953,951,950,949,948,947,946,945,944,943,942,941,939,940,938,937,955,909,881,900,871,890,855,862,815,843,833,799,782,772,761,733,726,708,701,692,675,666,659,650,643,634,600,608,744,590,581,565,556,549,538,531,514,507,483,464,476,456,426,442,415,408,397,378,367,358,330,346,322,315,296,280,272,265,257,250,222,203,214,196,187,180,165,145,172,134,127,105,101,126,94,79,73,88,64,155,66];
setList = ['蒸汽朋克套','学习套','秋收套','蒸汽朋克套','秋收套','学习套','秋收套','秋收套','热带套','恶魔套','恶魔套','热带套','恶魔套','恶魔套','热带套','夏夜套','夏夜套','热带套','弹珠套','夏夜套','泡泡套','泡泡套','弹珠套','泡泡套','泡泡套','弹珠套','舞娘套','舞娘套','弹珠套','舞娘套','舞娘套','春天套','夏夜套','火车套','火车套','火车套','春天套','火车套','春天套','复活节套','复活节套','春天套','复活节套','复活节套','茶会套','花语套','花语套','花语套','花语套','茶会套','茶会套','情人节3套','情人节3套','情人节3套','茶会套','情人节3套','RPG套','过年套','过年套','过年套','过年套','RPG套','RPG套','雪精灵套','雪精灵套','雪精灵套','RPG套','宇宙套','乐队套','雪精灵套','乐队套','乐队套','乐队套','宇宙套','宇宙套','宇宙套','宇宙套','宇宙套','水果套','宇宙套','旗袍套','宇宙套','旗袍套','水果套','水果套','旗袍套','旗袍套','夏日套','夏日套','魔法使套','夏日套','夏日套','人鱼套','人鱼套','人鱼套','魔法使套','魔法使套','人鱼套','婚纱套','婚纱套','魔法使套','婚纱套','婚纱套','爱丽丝套','童话套','水果套','童话套','爱丽丝套','童话套','童话套','爱丽丝套','教师套','教师套','教师套','爱丽丝套','教师套','天空套','摇滚套','摇滚套','摇滚套','天空套','天空套','情人节2套','情人节2套','天空套','情人节2套','情人节2套','乐器套','正月套','正月套','正月套','乐器套','正月套','乐器套','圣歌套','圣歌套','摇滚套','圣歌套','圣歌套','乐器套','蜡笔套','枫叶套','枫叶套','蜡笔套','枫叶套','枫叶套','蜡笔套','万圣2套','万圣2套','万圣2套','海盗套','蜡笔套','万圣2套','爱丽丝套','爱丽丝套','爱丽丝套','海盗套','海盗套','爱丽丝套','海滩套','海滩套','冰淇淋套','海滩套','海滩套','海盗套','马戏套','马戏套','冰淇淋套','马戏套','冰淇淋套','马戏套','电玩套','电玩套','电玩套','网球套','冰淇淋套','电玩套','天使套','天使套','天使套','天使套','动物套','动物套','网球套','动物套','动物套','花束套','职业套','职业套','花束套','职业套','职业套','花束套','情人节套','网球套','网球套','情人节套','花束套','情人节套','情人节套','睡衣套','新年套','新年套','睡衣套','新年套','新年套','睡衣套','圣诞套','圣诞套','睡衣套','圣诞套','诞生石套','圣诞套','拉拉队套','诞生石套','拉拉队套','拉拉队套','诞生石套','万圣套','万圣套','诞生石套','万圣套','万圣套','泳池套','浴衣套','浴衣套','泳池套','浴衣套','浴衣套','拉拉队套','泳池套','泳衣套','泳衣套','泳衣套','泳池套','泳衣套','恶魔套','初始UR套','初始UR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始SSR套','初始UR套','恶魔套','舞娘套','偶像套','舞娘套','偶像套','棒球套','棒球套','妖精套','大正套','大正套','妖精套','马戏套','马戏套','圣歌套','舞会套','舞会套','动物2套','动物2套','忍者套','忍者套','森女套','森女套','海军套','海军套','魔术套','电玩套','魔术套','圣歌套','电玩套','职业2套','职业2套','白情套','白情套','旗手套','旗手套','福神套','福神套','滑雪套','星座套','滑雪套','星座套','万圣套','万圣套','女仆套','女仆套','旗袍套','旗袍套','人鱼套','人鱼套','婚纱套','婚纱套','童话套','童话套','打工套','打工套','花语套','花语套','情人节套','情人节套','新年套','圣诞套','新年套','圣诞套','厨娘套','厨娘套','拉拉队套','浴衣套','拉拉队套','真夏套','真夏套','初始UR套','初始UR套','初始UR套','初始UR套','初始UR套','初始UR套','初始UR套','初始UR套','浴衣套','初始UR套'];

let content = document.getElementById("mm-blocker");

let cardDom = document.createElement("div");
let urlDom = document.createElement("div");

content.appendChild(cardDom);
content.appendChild(urlDom);

for (let i = 0; i < idList.length; i++) {
    let xml_new = new XMLHttpRequest();
    xml_new.open("GET", "https://card.niconi.co.ni/cardApi/" + idList[i], true);
    xml_new.onreadystatechange = function() {
        if (xml_new.readyState === 4 && xml_new.status === 200) {
            let data_new = JSON.parse(xml_new.responseText);

            if (data_new["pair"] !== false && data_new["pair"]["right_normal_card_id"] !== false) {
                let numberTag = data_new["tags"][0]["name"];

                let weijueName;
                if (data_new["pair"]["detail"]["normal_card_id"] === data_new["pair"]["left_normal_card_id"]) {
                    weijueName = data_new["pair"]["detail"]["name"] + '_' + data_new["type"]["name"];
                    let weijueCard = data_new["pair"]["right_normal_card_id"] + '-' + numberTag + '-' + setList[i] + "-普通-" + weijueName;
                    let url1 = "https://card.niconi.co.ni/pair/nb/" + data_new["pair"]["left_normal_card_id"] + '/' + data_new["pair"]["right_normal_card_id"] + '.png';
                    cardDom.innerHTML = cardDom.innerHTML + "<p>" + weijueCard +  "</p>";
                    urlDom.innerHTML = urlDom.innerHTML + "<p>" + url1 +  "</p>";
                    console.log(weijueCard);
                    console.log(url1);
                }
                let juexingName;
                if (data_new["pair"]["detail"]["rank_max_card_id"] === data_new["pair"]["left_rank_max_card_id"]) {

                    juexingName = data_new["pair"]["detail"]["name"] + '_' + data_new["type"]["name"];
                    let juexingCard = data_new["pair"]["right_rank_max_card_id"] + '-' + numberTag + '-' + setList[i] + "-觉醒-" + juexingName;
                    let url2 = "https://card.niconi.co.ni/pair/nb/" + data_new["pair"]["left_rank_max_card_id"] + '/' + data_new["pair"]["right_rank_max_card_id"] + '.png';
                    cardDom.innerHTML = cardDom.innerHTML + "<p>" + juexingCard + "</p>";
                    urlDom.innerHTML = urlDom.innerHTML + "<p>" + url2 + "</p>";
                    console.log(juexingCard);
                    console.log(url2);
                }
                console.log("------------------");
            }




        }
    };
    xml_new.send();
}

